output1/report.log
2025-02-10 07:54:57,681 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-02-10 07:54:57,711 INFO o.a.j.JMeter: Loading user properties from: /jmeter/apache-jmeter-5.0/bin/user.properties
2025-02-10 07:54:57,711 INFO o.a.j.JMeter: Loading system properties from: /jmeter/apache-jmeter-5.0/bin/system.properties
2025-02-10 07:54:57,721 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2025-02-10 07:54:57,721 INFO o.a.j.JMeter: Version 5.0 r1840935
2025-02-10 07:54:57,721 INFO o.a.j.JMeter: java.version=1.8.0_181
2025-02-10 07:54:57,721 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-02-10 07:54:57,721 INFO o.a.j.JMeter: os.name=Linux
2025-02-10 07:54:57,721 INFO o.a.j.JMeter: os.arch=amd64
2025-02-10 07:54:57,722 INFO o.a.j.JMeter: os.version=6.8.0-1021-aws
2025-02-10 07:54:57,722 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-02-10 07:54:57,722 INFO o.a.j.JMeter: Max memory     =1073741824
2025-02-10 07:54:57,722 INFO o.a.j.JMeter: Available Processors =2
2025-02-10 07:54:57,732 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-02-10 07:54:57,732 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-02-10 07:54:57,733 INFO o.a.j.JMeter: JMeterHome=/jmeter/apache-jmeter-5.0
2025-02-10 07:54:57,733 INFO o.a.j.JMeter: user.dir  =/jmeter/apache-jmeter-5.0
2025-02-10 07:54:57,733 INFO o.a.j.JMeter: PWD       =/jmeter/apache-jmeter-5.0
2025-02-10 07:54:57,733 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: e8753a98cb3d FullName: e8753a98cb3d
2025-02-10 07:54:57,737 INFO o.a.j.s.FileServer: Default base='/jmeter/apache-jmeter-5.0'
2025-02-10 07:54:57,746 INFO o.a.j.s.FileServer: Set new base='/jmeter/output'
2025-02-10 07:54:57,955 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-02-10 07:54:57,973 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-02-10 07:54:57,979 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-02-10 07:54:57,987 INFO o.a.j.s.SaveService: Loading file: /jmeter/output/target.jmx
2025-02-10 07:54:58,056 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:54:58,056 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:54:58,056 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:54:58,056 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:54:58,056 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-02-10 07:54:58,057 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-02-10 07:54:58,172 INFO o.a.j.JMeter: Creating summariser <summary>
2025-02-10 07:54:58,180 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-02-10 07:54:58,181 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-02-10 07:54:58,181 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-02-10 07:54:58,189 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-02-10 07:54:58,189 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-02-10 07:54:58,860 INFO o.a.j.JMeter: Running test (1739174098860)
2025-02-10 07:54:58,921 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Predict API 
2025-02-10 07:54:58,921 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Predict API .
2025-02-10 07:54:58,921 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-02-10 07:54:58,922 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=5 perThread=1000.0 delayedStart=false
2025-02-10 07:54:59,021 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-02-10 07:54:59,022 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-02-10 07:54:59,031 INFO o.a.j.t.JMeterThread: Thread started: Predict API  1-1
2025-02-10 07:54:59,036 INFO o.a.j.s.FileServer: Stored: /jmeter/output/keywords.txt
2025-02-10 07:54:59,080 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = e8753a98cb3d
2025-02-10 07:54:59,098 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-02-10 07:54:59,105 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-02-10 07:54:59,106 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-02-10 07:54:59,106 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-02-10 07:54:59,106 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-02-10 07:54:59,309 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2025-02-10 07:54:59,316 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-02-10 07:54:59,316 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-02-10 07:54:59,382 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2025-02-10 07:54:59,385 INFO o.a.j.u.SSLManager: KeyStore created OK
2025-02-10 07:54:59,385 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2025-02-10 07:55:00,030 INFO o.a.j.t.JMeterThread: Thread started: Predict API  1-2
2025-02-10 07:55:00,119 INFO o.a.j.r.Summariser: summary +      4 in 00:00:01 =    3.2/s Avg:   181 Min:    70 Max:   443 Err:     0 (0.00%) Active: 2 Started: 2 Finished: 0
2025-02-10 07:55:01,031 INFO o.a.j.t.JMeterThread: Thread started: Predict API  1-3
2025-02-10 07:55:01,707 INFO o.a.j.t.JMeterThread: Thread is done: Predict API  1-1
2025-02-10 07:55:01,707 INFO o.a.j.t.JMeterThread: Thread finished: Predict API  1-1
2025-02-10 07:55:02,030 INFO o.a.j.t.JMeterThread: Thread started: Predict API  1-4
2025-02-10 07:55:02,744 INFO o.a.j.t.JMeterThread: Thread is done: Predict API  1-3
2025-02-10 07:55:02,744 INFO o.a.j.t.JMeterThread: Thread finished: Predict API  1-3
2025-02-10 07:55:03,032 INFO o.a.j.t.JMeterThread: Thread started: Predict API  1-5
2025-02-10 07:55:03,064 INFO o.a.j.t.JMeterThread: Thread is done: Predict API  1-2
2025-02-10 07:55:03,064 INFO o.a.j.t.JMeterThread: Thread finished: Predict API  1-2
2025-02-10 07:55:03,710 INFO o.a.j.t.JMeterThread: Thread is done: Predict API  1-4
2025-02-10 07:55:03,710 INFO o.a.j.t.JMeterThread: Thread finished: Predict API  1-4
2025-02-10 07:55:04,474 INFO o.a.j.t.JMeterThread: Thread is done: Predict API  1-5
2025-02-10 07:55:04,474 INFO o.a.j.t.JMeterThread: Thread finished: Predict API  1-5
2025-02-10 07:55:04,475 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-02-10 07:55:04,475 INFO o.a.j.s.FileServer: Close: /jmeter/output/keywords.txt
2025-02-10 07:55:04,477 INFO o.a.j.r.Summariser: summary +     96 in 00:00:04 =   22.0/s Avg:    86 Min:    52 Max:  1101 Err:     0 (0.00%) Active: 0 Started: 5 Finished: 5
2025-02-10 07:55:04,477 INFO o.a.j.r.Summariser: summary =    100 in 00:00:06 =   17.8/s Avg:    89 Min:    52 Max:  1101 Err:     0 (0.00%)