output1/report.log
2025-02-10 07:44:30,038 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-02-10 07:44:30,065 INFO o.a.j.JMeter: Loading user properties from: /jmeter/apache-jmeter-5.0/bin/user.properties
2025-02-10 07:44:30,065 INFO o.a.j.JMeter: Loading system properties from: /jmeter/apache-jmeter-5.0/bin/system.properties
2025-02-10 07:44:30,074 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: Version 5.0 r1840935
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: java.version=1.8.0_181
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: os.name=Linux
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: os.arch=amd64
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: os.version=6.8.0-1021-aws
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: Max memory     =1073741824
2025-02-10 07:44:30,075 INFO o.a.j.JMeter: Available Processors =2
2025-02-10 07:44:30,085 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-02-10 07:44:30,086 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-02-10 07:44:30,086 INFO o.a.j.JMeter: JMeterHome=/jmeter/apache-jmeter-5.0
2025-02-10 07:44:30,086 INFO o.a.j.JMeter: user.dir  =/jmeter/apache-jmeter-5.0
2025-02-10 07:44:30,087 INFO o.a.j.JMeter: PWD       =/jmeter/apache-jmeter-5.0
2025-02-10 07:44:30,087 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: d4c8bcead29b FullName: d4c8bcead29b
2025-02-10 07:44:30,092 INFO o.a.j.s.FileServer: Default base='/jmeter/apache-jmeter-5.0'
2025-02-10 07:44:30,099 INFO o.a.j.s.FileServer: Set new base='/jmeter/output'
2025-02-10 07:44:30,284 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-02-10 07:44:30,305 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-02-10 07:44:30,311 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-02-10 07:44:30,319 INFO o.a.j.s.SaveService: Loading file: /jmeter/output/target.jmx
2025-02-10 07:44:30,384 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:44:30,384 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:44:30,384 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:44:30,384 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-10 07:44:30,385 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-02-10 07:44:30,385 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-02-10 07:44:30,496 INFO o.a.j.JMeter: Creating summariser <summary>
2025-02-10 07:44:30,506 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-02-10 07:44:30,507 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-02-10 07:44:30,507 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-02-10 07:44:30,516 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-02-10 07:44:30,516 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-02-10 07:44:31,153 INFO o.a.j.JMeter: Running test (1739173471153)
2025-02-10 07:44:31,213 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Search API 
2025-02-10 07:44:31,213 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Search API .
2025-02-10 07:44:31,214 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-02-10 07:44:31,214 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 perThread=200.0 delayedStart=false
2025-02-10 07:44:31,300 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-02-10 07:44:31,300 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-02-10 07:44:31,311 INFO o.a.j.t.JMeterThread: Thread started: Search API  1-1
2025-02-10 07:44:31,314 INFO o.a.j.s.FileServer: Stored: /jmeter/output/keywords.txt
2025-02-10 07:44:31,339 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = d4c8bcead29b
2025-02-10 07:44:31,350 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-02-10 07:44:31,353 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-02-10 07:44:31,353 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-02-10 07:44:31,353 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-02-10 07:44:31,354 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-02-10 07:44:31,508 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2025-02-10 07:44:31,514 INFO o.a.j.t.JMeterThread: Thread started: Search API  1-2
2025-02-10 07:44:31,520 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-02-10 07:44:31,520 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-02-10 07:44:31,605 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2025-02-10 07:44:31,608 INFO o.a.j.u.SSLManager: KeyStore created OK
2025-02-10 07:44:31,608 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2025-02-10 07:44:31,714 INFO o.a.j.t.JMeterThread: Thread started: Search API  1-3
2025-02-10 07:44:31,914 INFO o.a.j.t.JMeterThread: Thread started: Search API  1-4
2025-02-10 07:44:32,112 INFO o.a.j.t.JMeterThread: Thread started: Search API  1-5
2025-02-10 07:44:32,471 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,472 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,475 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,490 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    0.7/s Avg:   865 Min:   865 Max:   865 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
2025-02-10 07:44:32,570 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,575 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,924 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,946 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,969 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,983 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:32,988 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,235 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,309 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,322 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,338 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,348 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,571 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,736 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,750 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,762 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,783 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:33,836 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,027 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,060 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,117 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,167 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,184 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,363 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,417 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,456 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,466 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,566 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,660 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,820 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,841 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,852 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,874 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:34,896 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,167 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,251 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,271 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,275 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,286 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,332 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,633 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,635 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,645 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,660 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:35,663 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,026 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,041 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,046 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,081 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,091 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,418 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,432 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,449 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,455 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,458 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,738 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,760 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,776 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,770 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:36,778 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,144 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,145 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,160 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,176 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,192 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,496 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,506 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,529 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,535 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,548 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,879 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,880 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,892 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,898 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:37,912 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,202 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,218 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,218 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,259 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,260 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,642 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,658 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,658 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,682 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,699 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,887 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:38,964 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,057 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,072 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,075 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,136 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,139 INFO o.a.j.t.JMeterThread: Thread is done: Search API  1-4
2025-02-10 07:44:39,139 INFO o.a.j.t.JMeterThread: Thread finished: Search API  1-4
2025-02-10 07:44:39,284 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,385 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,412 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,417 INFO o.a.j.t.JMeterThread: Thread is done: Search API  1-5
2025-02-10 07:44:39,417 INFO o.a.j.t.JMeterThread: Thread finished: Search API  1-5
2025-02-10 07:44:39,419 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,421 INFO o.a.j.t.JMeterThread: Thread is done: Search API  1-2
2025-02-10 07:44:39,421 INFO o.a.j.t.JMeterThread: Thread finished: Search API  1-2
2025-02-10 07:44:39,516 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,517 INFO o.a.j.t.JMeterThread: Thread is done: Search API  1-3
2025-02-10 07:44:39,517 INFO o.a.j.t.JMeterThread: Thread finished: Search API  1-3
2025-02-10 07:44:39,599 INFO o.a.j.u.BeanShellTestElement: All required fields are present in the response.
2025-02-10 07:44:39,600 INFO o.a.j.t.JMeterThread: Thread is done: Search API  1-1
2025-02-10 07:44:39,600 INFO o.a.j.t.JMeterThread: Thread finished: Search API  1-1
2025-02-10 07:44:39,603 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-02-10 07:44:39,603 INFO o.a.j.s.FileServer: Close: /jmeter/output/keywords.txt
2025-02-10 07:44:39,604 INFO o.a.j.r.Summariser: summary +     99 in 00:00:07 =   13.9/s Avg:   357 Min:   151 Max:   900 Err:     0 (0.00%) Active: 0 Started: 5 Finished: 5
2025-02-10 07:44:39,606 INFO o.a.j.r.Summariser: summary =    100 in 00:00:08 =   11.8/s Avg:   362 Min:   151 Max:   900 Err:     0 (0.00%)